Revit 2027 API
IFCProductWrapper.FindExtrusionCreationParameters Method
 Obtains the extrusion creation data associated with the given element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExtrusionCreationData FindExtrusionCreationParameters(
	IFCAnyHandle elementHandle
)
Public Function FindExtrusionCreationParameters (
	elementHandle As IFCAnyHandle
) As IFCExtrusionCreationData
public:
IFCExtrusionCreationData^ FindExtrusionCreationParameters(
	IFCAnyHandle^ elementHandle
)
member FindExtrusionCreationParameters :
        elementHandle : IFCAnyHandle -> IFCExtrusionCreationData
Parameters
elementHandle IFCAnyHandle
 The handle.
Return Value
IFCExtrusionCreationData
 The parameters. null if no parameters are associated with the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace